[Whiplash X2AbilityTemplate]
LocFriendlyName="Whiplash"
LocLongDescription="Attack an enemy with an electrical lash. This attack does not cost an action."
LocHelpText="A free attack with an electrical lash. Double damage to robotic units."
LocPromotionPopupText="<Bullet/> Whiplash does double damage to robotic enemies."

[Battlelord X2AbilityTemplate]
LocFriendlyName="Battlelord"
LocLongDescription="After each enemy in line of sight takes a turn, take an immediate action."
LocHelpText="After each enemy in line of sight takes a turn, take an immediate action."
LocFlyOverText="Battlelord"
LocPromotionPopupText="<Bullet/> Battlelord can allow the Skirmisher to prevail in the most dire of circumstances.<br/><Bullet/> Battlelord has a <Ability:SelfCooldown/> turn cooldown..<br/><Bullet/> Turns from the Lost and enemy pod reveals do not grant the immediate action.<br/>"

[SkirmisherInterrupt X2AbilityTemplate]
LocFriendlyName="Interrupt"
LocLongDescription="A powerful form of Overwatch. Instead of firing automatically, perform any single action."
LocHelpText="A powerful form of Overwatch. Instead of firing automatically, perform any single action."
LocFlyOverText="Interrupt"
LocPromotionPopupText="<Bullet/> Some actions are not available during Interrupt, like Overwatch. <br/>"

[SkirmisherInterruptInput X2AbilityTemplate]
LocFriendlyName="Interrupt"
LocLongDescription="A powerful form of Overwatch. Instead of firing automatically, perform any single action."
LocHelpText="A powerful form of Overwatch. Instead of firing automatically, perform any single action."
LocFlyOverText="Interrupt"
LocPromotionPopupText="<br/><Bullet/> Some actions are not available during Interrupt, like Overwatch. <br/>"

[SkirmisherReflex X2AbilityTemplate]
LocFriendlyName="Reflex"
LocLongDescription="When fired upon, gain one extra action on the next turn. This does not stack."
LocHelpText="When fired upon, gain one extra action on the next turn. This does not stack."
LocFlyoverText="Reflex: +1 Action Next Turn"
LocPromotionPopupText="<Bullet/> The Grapple makes the Skirmisher a great advance scout, and Reflex rewards their aggressive positioning.<br/>"

[Parkour X2AbilityTemplate]
LocFriendlyName="Parkour"
LocLongDescription="All Skirmishers now start with a free movement action point in addition to their two standard action points every turn."
LocHelpText="All Skirmishers now start with a free movement action point in addition to their two standard action points every turn."

[ParkourPassive X2AbilityTemplate]
LocFriendlyName="Parkour"
LocLongDescription="All Skirmishers now start with a free movement action point in addition to their two standard action points every turn."
LocHelpText="All Skirmishers now start with a free movement action point in addition to their two standard action points every turn."


[ParkourUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="Skirmisher: Parkour"
Summary="All Skirmishers now start with a free movement action point in addition to their two standard action points every turn."
